---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDetailLevel
source: html/5411dc89-b216-9878-2559-4d75ca7ad535.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDetailLevel Property

"Detail Level"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDetailLevel { get; }
```